[Killed] Linq method mutation (Max() to Min())
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:7:29
 {
     public decimal Subtotal { get; private set; }
     public decimal DiscountAmount { get; private set; }
-    public decimal Total => Math.Max(0, Subtotal - DiscountAmount);
+    public decimal Total => Math.Min(0, Subtotal - DiscountAmount);
 
     public DiscountPolicy(decimal subtotal)

[Killed] Arithmetic mutation
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:7:41
 {
     public decimal Subtotal { get; private set; }
     public decimal DiscountAmount { get; private set; }
-    public decimal Total => Math.Max(0, Subtotal - DiscountAmount);
+    public decimal Total => Math.Max(0, Subtotal + DiscountAmount);
 
     public DiscountPolicy(decimal subtotal)

[Killed] Negate expression
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:11:13
 
     public DiscountPolicy(decimal subtotal)
     {
-        if (subtotal < 0)
+        if (!(subtotal < 0))
             throw new ArgumentOutOfRangeException(nameof(subtotal), "Subtotal cannot be negative.");
 

[Killed] Equality mutation
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:11:13
 
     public DiscountPolicy(decimal subtotal)
     {
-        if (subtotal < 0)
+        if (subtotal > 0)
             throw new ArgumentOutOfRangeException(nameof(subtotal), "Subtotal cannot be negative.");
 

[NoCoverage] Statement mutation
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:12:13
     public DiscountPolicy(decimal subtotal)
     {
         if (subtotal < 0)
-            throw new ArgumentOutOfRangeException(nameof(subtotal), "Subtotal cannot be negative.");
+            ;
 
         Subtotal = subtotal;

[Killed] Negate expression
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:19:13
 
     public bool ApplyPromoCode(string promoCode)
     {
-        if (string.Equals(promoCode, "SUMMER2026", StringComparison.OrdinalIgnoreCase))
+        if (!(string.Equals(promoCode, "SUMMER2026", StringComparison.OrdinalIgnoreCase)))
         {
             // Boundary condition: strictly greater than 1000 UAH

[Killed] String mutation
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:19:38
 
     public bool ApplyPromoCode(string promoCode)
     {
-        if (string.Equals(promoCode, "SUMMER2026", StringComparison.OrdinalIgnoreCase))
+        if (string.Equals(promoCode, "", StringComparison.OrdinalIgnoreCase))
         {
             // Boundary condition: strictly greater than 1000 UAH

[Killed] Equality mutation
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:22:17
         if (string.Equals(promoCode, "SUMMER2026", StringComparison.OrdinalIgnoreCase))
         {
             // Boundary condition: strictly greater than 1000 UAH
-            if (Subtotal > 1000m)
+            if (Subtotal < 1000m)
             {
                 DiscountAmount = Subtotal * 0.10m;

[Killed] Negate expression
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:22:17
         if (string.Equals(promoCode, "SUMMER2026", StringComparison.OrdinalIgnoreCase))
         {
             // Boundary condition: strictly greater than 1000 UAH
-            if (Subtotal > 1000m)
+            if (!(Subtotal > 1000m))
             {
                 DiscountAmount = Subtotal * 0.10m;

[Killed] Arithmetic mutation
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:24:34
             // Boundary condition: strictly greater than 1000 UAH
             if (Subtotal > 1000m)
             {
-                DiscountAmount = Subtotal * 0.10m;
+                DiscountAmount = Subtotal / 0.10m;
                 return true;
             }

[Survived] Boolean mutation
Domain/DeterministicAiLab.Domain/Entities/DiscountPolicy.cs:25:24
             if (Subtotal > 1000m)
             {
                 DiscountAmount = Subtotal * 0.10m;
-                return true;
+                return false;
             }
         }
